In [1]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [3]:
pip install pandas

Collecting pandas
  Downloading pandas-1.3.1-cp38-cp38-win_amd64.whl (10.4 MB)
Note: you may need to restart the kernel to use updated packages.
Collecting pytz>=2017.3
  Downloading pytz-2021.1-py2.py3-none-any.whl (510 kB)
Requirement already satisfied: numpy>=1.17.3 in c:\users\tibame\anaconda3\envs\tfb103\lib\site-packages (from pandas) (1.21.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\tibame\anaconda3\envs\tfb103\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\tibame\anaconda3\envs\tfb103\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.3.1 pytz-2021.1

In [2]:
x = pd.Series([5,4,3,2,1])

In [4]:
x.values

array([5, 4, 3, 2, 1], dtype=int64)

In [5]:
x.dtype

dtype('int64')

In [6]:
x.dtype.name

'int64'

In [7]:
x[0]

5

In [9]:
x[[0,2,1]]

0    5
2    3
1    4
dtype: int64

In [10]:
y = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [11]:
y

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
y.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [13]:
y['a']

1

In [14]:
y[0]

1

In [15]:
y[['a','c','b']]

a    1
c    3
b    2
dtype: int64

In [25]:
print(y+2)
print(y*3)
print(y-3)
print(y/2)
print(y>3)
print(y<3)

a    3
b    4
c    5
d    6
e    7
dtype: int64
a     3
b     6
c     9
d    12
e    15
dtype: int64
a   -2
b   -1
c    0
d    1
e    2
dtype: int64
a    0.5
b    1.0
c    1.5
d    2.0
e    2.5
dtype: float64
a    False
b    False
c    False
d     True
e     True
dtype: bool
a     True
b     True
c    False
d    False
e    False
dtype: bool

In [26]:
y[y>3]

d    4
e    5
dtype: int64

In [27]:
y[y>3/2]

b    2
c    3
d    4
e    5
dtype: int64

In [28]:
y[y==3]

c    3
dtype: int64

In [29]:
z = pd.Series({'apple':10,'banana':20,'orange':20,'peach':60})

In [31]:
z

apple     10
banana    20
orange    20
peach     60
dtype: int64

In [39]:
z[z>40].index.to_list()

['peach']

In [33]:
z.unique()

array([10, 20, 60], dtype=int64)

In [36]:
z.index

Index(['apple', 'banana', 'orange', 'peach'], dtype='object')

In [41]:
data1 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F']}
df1 = pd.DataFrame(data1)
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [66]:
data2 = [['Alan Chen', 23, 'M'], 
         ['Bob Yeh', 30, 'M'],
         ['Connie Ho', 38, 'F'],
         ['Daniel Chang', 27, 'M'],
         ['Ella Hsu', 45, 'F']]
df2 = pd.DataFrame(data2, columns=['name', 'age', 'sex'])
df2

           name  age sex
0     Alan Chen   23   M
1       Bob Yeh   30   M
2     Connie Ho   38   F
3  Daniel Chang   27   M
4      Ella Hsu   45   F

In [47]:
df1.columns

Index(['name', 'age', 'sex'], dtype='object')

In [49]:
df1.index

RangeIndex(start=0, stop=5, step=1)

In [50]:
df1.values

array([['Alan', 23, 'M'],
       ['Bob', 30, 'M'],
       ['Connie', 38, 'F'],
       ['Daniel', 27, 'M'],
       ['Ella', 45, 'F']], dtype=object)

In [51]:
df1['name']

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [52]:
df1[['name']]

     name
0    Alan
1     Bob
2  Connie
3  Daniel
4    Ella

In [53]:
df1[['name','age']]

     name  age
0    Alan   23
1     Bob   30
2  Connie   38
3  Daniel   27
4    Ella   45

In [54]:
df1[:3]['name']

0      Alan
1       Bob
2    Connie
Name: name, dtype: object

In [55]:
df1['name'][:3]

0      Alan
1       Bob
2    Connie
Name: name, dtype: object

In [56]:
df1 == 'F'

    name    age    sex
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False  False
4  False  False   True

In [59]:
df1[df1['sex'] == 'F']

     name  age sex
2  Connie   38   F
4    Ella   45   F

In [60]:
df1[df1['sex'] == 'F']['age']

2    38
4    45
Name: age, dtype: int64

In [62]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   sex     5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [68]:
df1.describe()

             age
count   5.000000
mean   32.600000
std     8.848729
min    23.000000
25%    27.000000
50%    30.000000
75%    38.000000
max    45.000000

In [69]:
df1.drop('age',axis=1)

     name sex
0    Alan   M
1     Bob   M
2  Connie   F
3  Daniel   M
4    Ella   F

In [67]:
del df2['age']
df2

           name sex
0     Alan Chen   M
1       Bob Yeh   M
2     Connie Ho   F
3  Daniel Chang   M
4      Ella Hsu   F

In [71]:
data3 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella', 'Alan'],
        'age': [23, 30, 38, 27, 45, 10],
        'sex': ['M', 'M', 'F', 'M', 'F', 'M']}
df3 = pd.DataFrame(data3)
df3

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F
5    Alan   10   M

In [72]:
df1.iloc[0]

name    Alan
age       23
sex        M
Name: 0, dtype: object

In [74]:
df1.iloc[3,0]

'Daniel'

In [75]:
df1.iloc[:3,0]

0      Alan
1       Bob
2    Connie
Name: name, dtype: object

In [76]:
df1.iloc[0,:2]

name    Alan
age       23
Name: 0, dtype: object

In [77]:
df1.iloc[[0,2,4],0]

0      Alan
2    Connie
4      Ella
Name: name, dtype: object

In [79]:
df1.iloc[[3,2,1,4],[0,2,1]]

     name sex  age
3  Daniel   M   27
2  Connie   F   38
1     Bob   M   30
4    Ella   F   45

In [80]:
df1.loc[:,'name']

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [81]:
df1.loc[:,['name','age']]

     name  age
0    Alan   23
1     Bob   30
2  Connie   38
3  Daniel   27
4    Ella   45

In [82]:
df1.index = ['a','b','c','d','e']

In [83]:
df1.loc[:'d',['name','age']]

     name  age
a    Alan   23
b     Bob   30
c  Connie   38
d  Daniel   27

In [84]:
df1.loc[df1.age >30 ,'name']

c    Connie
e      Ella
Name: name, dtype: object

In [85]:
df1.loc[df1.age > 30,['name']]

     name
c  Connie
e    Ella

In [88]:
df1.loc[df1.age >30,'age'] = 40

In [89]:
df1

     name  age sex
a    Alan   23   M
b     Bob   30   M
c  Connie   40   F
d  Daniel   27   M
e    Ella   40   F

In [93]:
df1['sex'].str.replace('M','Male')

a    Male
b    Male
c       F
d    Male
e       F
Name: sex, dtype: object

In [98]:
df1[df1['name'].str.startswith('D')]

     name  age sex
d  Daniel   27   M

In [103]:
df2['name'].str.split('')

0             [, A, l, a, n,  , C, h, e, n, ]
1                   [, B, o, b,  , Y, e, h, ]
2             [, C, o, n, n, i, e,  , H, o, ]
3    [, D, a, n, i, e, l,  , C, h, a, n, g, ]
4                [, E, l, l, a,  , H, s, u, ]
Name: name, dtype: object

In [104]:
df1[df1['name'].str.contains('n')]

     name  age sex
a    Alan   23   M
c  Connie   40   F
d  Daniel   27   M

In [105]:
df1['age'].apply(lambda x:'%.1f'%x)

a    23.0
b    30.0
c    40.0
d    27.0
e    40.0
Name: age, dtype: object

In [106]:
def f(series):
    return series -5
df1['age'].apply(f)

a    18
b    25
c    35
d    22
e    35
Name: age, dtype: int64

In [107]:
data3 = [[12, 25, 3, 34, 65],
         [65, 19, 28, 39, 10],
         [11, 19, 13, 34, 1]]
df3 = pd.DataFrame(data3, columns=['d', 'a', 'c', 'e', 'b'], index=['banana', 'apple', 'orange'])
df3

         d   a   c   e   b
banana  12  25   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

In [108]:
df3.sort_index()

         d   a   c   e   b
apple   65  19  28  39  10
banana  12  25   3  34  65
orange  11  19  13  34   1

In [110]:
df3.sort_index(axis=1)

         a   b   c   d   e
banana  25  65   3  12  34
apple   19  10  28  65  39
orange  19   1  13  11  34

In [113]:
df3.sort_index(axis=1,ascending=False)

         e   d   c   b   a
banana  34  12   3  65  25
apple   39  65  28  10  19
orange  34  11  13   1  19

In [112]:
df3.sort_values(by='a')

         d   a   c   e   b
apple   65  19  28  39  10
orange  11  19  13  34   1
banana  12  25   3  34  65

In [114]:
df3.sort_values(by='a',ascending=False)

         d   a   c   e   b
banana  12  25   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

In [115]:
df3.sort_values(by=['a','b'],ascending=False)

         d   a   c   e   b
banana  12  25   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

In [117]:
df3.rank()

          d    a    c    e    b
banana  2.0  3.0  1.0  1.5  3.0
apple   3.0  1.5  3.0  3.0  2.0
orange  1.0  1.5  2.0  1.5  1.0

In [120]:
df3.rank(method='max')

          d    a    c    e    b
banana  2.0  3.0  1.0  2.0  3.0
apple   3.0  2.0  3.0  3.0  2.0
orange  1.0  2.0  2.0  2.0  1.0

In [121]:
df3.rank(method="min")

          d    a    c    e    b
banana  2.0  3.0  1.0  1.0  3.0
apple   3.0  1.0  3.0  3.0  2.0
orange  1.0  1.0  2.0  1.0  1.0

In [122]:
df3.rank(method='first')

          d    a    c    e    b
banana  2.0  3.0  1.0  1.0  3.0
apple   3.0  1.0  3.0  3.0  2.0
orange  1.0  2.0  2.0  2.0  1.0

In [124]:
df1['sex'].value_counts()

M    3
F    2
Name: sex, dtype: int64

In [125]:
df1['sex'].value_counts().sort_values()

F    2
M    3
Name: sex, dtype: int64

In [118]:
data4 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F'],
        'dept': [1, 1, 1, 2, 2]}
df4 = pd.DataFrame(data4)
df4

     name  age sex  dept
0    Alan   23   M     1
1     Bob   30   M     1
2  Connie   38   F     1
3  Daniel   27   M     2
4    Ella   45   F     2

In [126]:
df4.groupby('sex').count()

     name  age  dept
sex
F       2    2     2
M       3    3     3

In [127]:
df4.groupby('sex').mean()

           age      dept
sex
F    41.500000  1.500000
M    26.666667  1.333333

In [129]:
df4.groupby('sex').max()

       name  age  dept
sex
F      Ella   45     2
M    Daniel   30     2

In [130]:
df4.groupby('sex').min()

       name  age  dept
sex
F    Connie   38     1
M      Alan   23     1

In [131]:
df4.groupby('sex').sum()

     age  dept
sex
F     83     3
M     80     4

In [132]:
df4.groupby('sex').prod()

       age  dept
sex
F     1710     2
M    18630     2

In [133]:
df4.groupby('sex').std()

          age      dept
sex
F    4.949747  0.707107
M    3.511885  0.577350

In [135]:
df4.groupby('sex').var()

           age      dept
sex
F    24.500000  0.500000
M    12.333333  0.333333

In [136]:
df4.groupby('sex').first()

       name  age  dept
sex
F    Connie   38     1
M      Alan   23     1

In [137]:
df4.groupby('sex').last()

       name  age  dept
sex
F      Ella   45     2
M    Daniel   27     2

In [138]:
df4.groupby(['sex','dept']).count()

          name  age
sex dept
F   1        1    1
    2        1    1
M   1        2    2
    2        1    1

In [139]:
df4.groupby(['sex','dept']).mean()

           age
sex dept
F   1     38.0
    2     45.0
M   1     26.5
    2     27.0

In [140]:
df4.groupby(['sex','dept']).count().rename(columns={'name':'count'})

          count  age
sex dept
F   1         1    1
    2         1    1
M   1         2    2
    2         1    1

In [141]:
df4.groupby(['sex','dept'],as_index=False).mean()

  sex  dept   age
0   F     1  38.0
1   F     2  45.0
2   M     1  26.5
3   M     2  27.0

In [142]:
df4.groupby(['sex','dept']).mean()

           age
sex dept
F   1     38.0
    2     45.0
M   1     26.5
    2     27.0

In [144]:
df4.groupby(['sex','dept']).agg('mean')

           age
sex dept
F   1     38.0
    2     45.0
M   1     26.5
    2     27.0

In [145]:
df4.groupby(['sex','dept']).agg(['mean','std'])

           age
          mean       std
sex dept
F   1     38.0       NaN
    2     45.0       NaN
M   1     26.5  4.949747
    2     27.0       NaN

In [146]:
df4.groupby(['sex','dept']).describe()

           age
         count  mean       std   min    25%   50%    75%   max
sex dept
F   1      1.0  38.0       NaN  38.0  38.00  38.0  38.00  38.0
    2      1.0  45.0       NaN  45.0  45.00  45.0  45.00  45.0
M   1      2.0  26.5  4.949747  23.0  24.75  26.5  28.25  30.0
    2      1.0  27.0       NaN  27.0  27.00  27.0  27.00  27.0

In [156]:
import numpy as np
x = pd.DataFrame([['Zoe', 32, np.nan, 59, 'banana'],
                  ['Sam', np.nan, 'M', np.nan, 'peach'],
                  ['Danny', 46, 'M', 81, 'apple']], columns=['name', 'age', 'sex', 'grade', 'fruit'])

x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [158]:
x.isnull().sum()

name     0
age      1
sex      1
grade    1
fruit    0
dtype: int64

In [159]:
x.isna().sum()

name     0
age      1
sex      1
grade    1
fruit    0
dtype: int64

In [160]:
x.notnull().sum()

name     3
age      2
sex      2
grade    2
fruit    3
dtype: int64

In [161]:
x.dropna()

    name   age sex  grade  fruit
2  Danny  46.0   M   81.0  apple

In [162]:
x.dropna(subset=['sex'])

    name   age sex  grade  fruit
1    Sam   NaN   M    NaN  peach
2  Danny  46.0   M   81.0  apple

In [163]:
x.fillna(99)

    name   age sex  grade   fruit
0    Zoe  32.0  99   59.0  banana
1    Sam  99.0   M   99.0   peach
2  Danny  46.0   M   81.0   apple

In [164]:
x['age'].fillna(x.age.mean())

0    32.0
1    39.0
2    46.0
Name: age, dtype: float64

In [170]:
x =x.fillna({'age':22,'sex':'F','grade':44})

In [171]:
sex = {'M':1,'F':0}

In [172]:
x['sex_map'] = x['sex'].map(sex)

In [173]:
x

    name   age sex  grade   fruit  sex_map
0    Zoe  32.0   F   59.0  banana        0
1    Sam  22.0   M   44.0   peach        1
2  Danny  46.0   M   81.0   apple        1

In [174]:
def letter_grade(grade):
    if grade < 60 :
        letter ='F'
    elif grade < 70:
        letter ='D'
    elif grade < 80:
        letter ='C'
    elif grade < 90:
        letter = 'B'
    else:
        letter = 'A'
    return letter

In [175]:
x['grade_map'] = x['grade'].map(letter_grade)

In [178]:
x

    name   age sex  grade   fruit  sex_map grade_map
0    Zoe  32.0   F   59.0  banana        0         F
1    Sam  22.0   M   44.0   peach        1         F
2  Danny  46.0   M   81.0   apple        1         B

In [179]:
grades = [45, 82, 56, 77, 90, 69, 72, 79, 85, 95, 62, 65]

In [196]:
pd.qcut(grades,5)

[(44.999, 62.6], (78.2, 84.4], (44.999, 62.6], (70.2, 78.2], (84.4, 95.0], ..., (78.2, 84.4], (84.4, 95.0], (84.4, 95.0], (44.999, 62.6], (62.6, 70.2]]
Length: 12
Categories (5, interval[float64]): [(44.999, 62.6] < (62.6, 70.2] < (70.2, 78.2] < (78.2, 84.4] < (84.4, 95.0]]

In [195]:
df['qcut'].value_counts()
df

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices